In [1]:
import numpy as np
import pandas as pd

s1 = pd.Series(np.random.randn(9),
          index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                 [1, 2, 3, 1, 2, 3, 1, 2, 3]])
s1

a  1   -0.246489
   2   -0.209186
   3   -0.964468
b  1    0.978323
   2   -1.383026
c  3    0.514300
   1   -0.786938
d  2   -2.528432
   3    1.474767
dtype: float64

In [2]:
s1.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('c', 3),
            ('c', 1),
            ('d', 2),
            ('d', 3)],
           )

In [3]:
s1.index.names = ['key1','key2']
s1

key1  key2
a     1      -0.246489
      2      -0.209186
      3      -0.964468
b     1       0.978323
      2      -1.383026
c     3       0.514300
      1      -0.786938
d     2      -2.528432
      3       1.474767
dtype: float64

In [4]:
s1.unstack(level='key1')

key1         a         b         c         d
key2
1    -0.246489  0.978323 -0.786938       NaN
2    -0.209186 -1.383026       NaN -2.528432
3    -0.964468       NaN  0.514300  1.474767

In [5]:
s1.unstack(level='key2')

key2         1         2         3
key1
a    -0.246489 -0.209186 -0.964468
b     0.978323 -1.383026       NaN
c    -0.786938       NaN  0.514300
d          NaN -2.528432  1.474767

In [6]:
display(s1['a'])
s1['a'][1]

key2
1   -0.246489
2   -0.209186
3   -0.964468
dtype: float64

-0.24648928672177203

In [7]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
             index=[['a','a','b','b'],[1, 2, 1, 2]],
             columns=[['台北','台北','台中'],['Green','Red','Green']])
frame.index.names = ["key1","key2"]
frame.columns.names = ["縣市","顏色"]
frame

縣市           台北        台中
顏色        Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [8]:
frame.stack(level=['縣市','顏色']).unstack(level=['縣市','key1'])

縣市           台中   台北    台中    台北
key1          a    a     b     b
key2 顏色
1    Green  2.0  0.0   8.0   6.0
     Red    NaN  1.0   NaN   7.0
2    Green  5.0  3.0  11.0   9.0
     Red    NaN  4.0   NaN  10.0

In [9]:
frame

縣市           台北        台中
顏色        Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [10]:
#依據key2,加總值
frame.groupby(level='key2').sum()

縣市      台北        台中
顏色   Green Red Green
key2
1        6   8    10
2       12  14    16

In [11]:
frame.groupby(level='key1').sum()

縣市      台北        台中
顏色   Green Red Green
key1
a        3   5     7
b       15  17    19

In [12]:
frame.groupby(level='顏色',axis=1).sum()

/tmp/ipykernel_33121/3270200324.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  frame.groupby(level='顏色',axis=1).sum()

顏色         Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [13]:
frame.T.groupby(level='顏色').sum()

key1   a      b
key2   1  2   1   2
顏色
Green  2  8  14  20
Red    1  4   7  10

In [14]:
frame = pd.DataFrame({'a':range(7), 'b':range(7, 0, -1),
                     'c':['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                     'd':[0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [15]:
#set_index()
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [16]:
#reset_index()
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1